src/DataProcessors/РабочееМестоКанбанУД_Мастер/РабочееМестоКанбанУД_Мастер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКанбанУД_Мастер</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Enums/ВидыЭлементовНормРасходов/ВидыЭлементовНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовНормРасходов</name>
  <enumValues>
    <name>Деталь</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>МатериалВспомогательный</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>Основа</name>
  </enumValues>
  <enumValues>
    <name>Программа</name>
  </enumValues>
  <enumValues>
    <name>ТехОперация</name>
  </enumValues>
  <enumValues>
    <name>ТехОснастка</name>
  </enumValues>
  <enumValues>
    <name>Узел</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/РабочееМестоКанбанУД_Мастер/Forms/ДобавлениеТО/Module.bsl
&НаСервере
Процедура ПолучитьТаблицуТО(ЭтапСпецификации,Количество)
ВыборкаДетальныеЗаписи = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_ТО(ЭтапСпецификации,ТекущаяДата());;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
		ПолучитьТаблицуТО(ВыборкаДетальныеЗаписи.Элемент,ПолучитьБазовоеКоличество(ВыборкаДетальныеЗаписи.Норма,ВыборкаДетальныеЗаписи.Элемент.ОсновнаяЕдиницаИзмерения)*Количество);
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.ТехОперация Тогда
		ТЧ = ТаблицаТО.Добавить();
		ТЧ.ТехОперация = ВыборкаДетальныеЗаписи.Элемент;
			Если ВыборкаДетальныеЗаписи.Элемент.Оборудование.Количество() > 0 Тогда
			ТЧ.Оборудование = ВыборкаДетальныеЗаписи.Элемент.Оборудование[0].Оборудование;
			ТЧ.Исполнитель = ВыборкаДетальныеЗаписи.Элемент.Оборудование[0].Сотрудник;
			ТЧ.Количество = ВыборкаДетальныеЗаписи.Норма*Количество;	
			КонецЕсли;
		ИначеЕсли (ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Деталь)или
				  (ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Узел) Тогда	
			Если Не ВыборкаДетальныеЗаписи.Элемент.Канбан.Пустая() Тогда	
			Продолжить; 
			КонецЕсли; 
		ПолучитьТаблицуТО(ВыборкаДетальныеЗаписи.Элемент,ПолучитьБазовоеКоличество(ВыборкаДетальныеЗаписи.Норма,ВыборкаДетальныеЗаписи.Элемент.ОсновнаяЕдиницаИзмерения)*Количество);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СписокПЗ = ЭтаФорма.Параметры.СписокПЗ;
ПолучитьТаблицуТО(СписокПЗ[0].Значение.Изделие,1);
КонецПроцедуры

&НаСервере
Функция ДобавитьНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Для каждого ПЗ Из СписокПЗ Цикл	
		ПЗОбъект = ПЗ.Значение.ПолучитьОбъект();
		ПЗОбъект.Оборудование.Очистить();
			Для каждого ТЧ Из ТаблицаТО Цикл
			ТЧ_О = ПЗОбъект.Оборудование.Добавить();
			ТЧ_О.ТехОперация = ТЧ.ТехОперация;
			ТЧ_О.Оборудование = ТЧ.Оборудование;
			ТЧ_О.Исполнитель = ТЧ.Исполнитель;
			ТЧ_О.Количество = ТЧ.Количество;
			ПЗОбъект.Записать();
			КонецЦикла;			
		КонецЦикла; 
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	КонецПопытки; 
Возврат(Истина);
КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	Если ДобавитьНаСервере() Тогда		
	ЭтаФорма.Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Ложь);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокИсполнителей(ТО)
СписокИсполнителей = Новый СписокЗначений;

	Для каждого ТЧ Из ТО.Оборудование Цикл	
	СписокИсполнителей.Добавить(ТЧ.Сотрудник,СокрЛП(ТЧ.Сотрудник.Наименование)+" ("+СокрЛП(ТЧ.Оборудование.Наименование)+")");
	КонецЦикла;
Возврат(СписокИсполнителей); 
КонецФункции

&НаСервере
Функция ПолучитьОборудование(ТО,Исполнитель)
	Для каждого ТЧ Из ТО.Оборудование Цикл	
		Если ТЧ.Сотрудник = Исполнитель Тогда
		Возврат(ТЧ.Оборудование);
		КонецЕсли;
	КонецЦикла;
Возврат(Справочники.Сотрудники.ПустаяСсылка()); 
КонецФункции 

&НаКлиенте
Процедура ТаблицаТОИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
СписокИсполнителей = ПолучитьСписокИсполнителей(Элементы.ТаблицаТО.ТекущиеДанные.ТехОперация);
Исполнитель = СписокИсполнителей.ВыбратьЭлемент("Выберите исполнителя");
	Если Исполнитель <> Неопределено Тогда
	Элементы.ТаблицаТО.ТекущиеДанные.Исполнитель = Исполнитель.Значение; 
	Элементы.ТаблицаТО.ТекущиеДанные.Оборудование = ПолучитьОборудование(Элементы.ТаблицаТО.ТекущиеДанные.ТехОперация,Исполнитель.Значение);
	КонецЕсли; 
КонецПроцедуры
